Revit 2027 API
BuiltInFailures.FamilyFailures.DeletingBadFamType Property
 Can't make type "[Family Name]". It will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingBadFamType { get; }
Public Shared ReadOnly Property DeletingBadFamType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingBadFamType {
	FailureDefinitionId^ get ();
}
static member DeletingBadFamType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace